Repository: jessfraz/dotfiles
Catalog: .vscode/extensions/*-mssql.mssql-1.9.0/localization/xliff/ptb/constants/localizedConstants.ptb.xlf
Languages: pt_br

# msgStartedExecute
source: Started query execution for document "{0}"
pt_br: Execução da consulta iniciada para o documento "{0}"

# msgFinishedExecute
source: Finished query execution for document "{0}"
pt_br: Execução da consulta concluída para o documento "{0}"

# msgRunQueryInProgress
source: A query is already running for this editor session. Please cancel this query or wait for its completion.
pt_br: Uma consulta está sendo executada para esta sessão do editor. Cancele esta consulta ou aguarde a conclusão.

# runQueryBatchStartMessage
source: Started executing query at
pt_br: Execução da consulta iniciada em

# runQueryBatchStartLine
source: Line {0}
pt_br: Linha {0}

# msgCancelQueryFailed
source: Canceling the query failed: {0}
pt_br: Falha no cancelamento da consulta: {0}

# msgCancelQueryNotRunning
source: Cannot cancel query as no query is running.
pt_br: Não é possível cancelar a consulta, pois não há consulta em execução.

# msgChooseDatabaseNotConnected
source: No connection was found. Please connect to a server first.
pt_br: Nenhuma conexão encontrada. Conecte-se a um servidor.

# msgChooseDatabasePlaceholder
source: Choose a database from the list below
pt_br: Escolha um banco de dados na lista abaixo

# msgConnectionError
source: Error {0}: {1}
pt_br: Erro {0}: {1}

# msgConnectionError2
source: Failed to connect: {0}
pt_br: Falha na conexão: {0}

# msgConnectionErrorPasswordExpired
source: Error {0}: {1} Please login as a different user and change the password using ALTER LOGIN.
pt_br: Erro {0}: {1}. Faça logon como um usuário diferente e altere a senha usando ALTER LOGIN.

# connectionErrorChannelName
source: Connection Errors
pt_br: Erros de conexão

# msgPromptCancelConnect
source: Server connection in progress. Do you want to cancel?
pt_br: Conexão ao servidor em andamento. Deseja cancelar?

# msgPromptClearRecentConnections
source: Confirm to clear recent connections list
pt_br: Confirme para limpar a lista de conexões recentes

# msgOpenSqlFile
source: To use this command, Open a .sql file -or- Change editor language to "SQL" -or- Select T-SQL text in the active SQL editor.
pt_br: Para usar este comando, abra um arquivo .sql, altere a linguagem do editor para "SQL" ou selecione o texto T-SQL no editor SQL ativo.

# recentConnectionsPlaceholder
source: Choose a connection profile from the list below
pt_br: Escolha um perfil de conexão da lista abaixo

# CreateProfileFromConnectionsListLabel
source: Create Connection Profile
pt_br: Criar perfil de conexão

# CreateProfileLabel
source: Create
pt_br: Criar

# ClearRecentlyUsedLabel
source: Clear Recent Connections List
pt_br: Limpar lista de conexões recentes

# EditProfilesLabel
source: Edit
pt_br: Editar

# RemoveProfileLabel
source: Remove
pt_br: Remover

# ManageProfilesPrompt
source: Manage Connection Profiles
pt_br: Gerenciar perfis de conexão

# SampleServerName
source: {{put-server-name-here}}
pt_br: {{coloque-o-nome-do-servidor-aqui}}

# serverPrompt
source: Server name or ADO.NET connection string
pt_br: Nome do servidor ou cadeia de conexão ADO.NET

# serverPlaceholder
source: hostname\\instance or <server>.database.windows.net or ADO.NET connection string
pt_br: hostname\\instance ou <servidor>.database.windows.net ou cadeia de conexão ADO.NET

# databasePrompt
source: Database name
pt_br: Nome do banco de dados

# startIpAddressPrompt
source: Start IP
pt_br: IP inicial

# endIpAddressPrompt
source: End IP
pt_br: IP final

# databasePlaceholder
source: [Optional] Database to connect (press Enter to connect to <default> database)
pt_br: [Opcional] Banco de dados ao qual se conectar (pressione Enter para conectar-se ao banco de dados <padrão>)

# authTypePrompt
source: Authentication Type
pt_br: Tipo de autenticação

# authTypeIntegrated
source: Integrated
pt_br: Integrado

# authTypeSql
source: SQL Login
pt_br: Logon do SQL

# usernamePrompt
source: User name
pt_br: Nome de usuário

# usernamePlaceholder
source: User name (SQL Login)
pt_br: Nome de usuário (logon do SQL)

# passwordPrompt
source: Password
pt_br: Senha

# passwordPlaceholder
source: Password (SQL Login)
pt_br: Senha (logon do SQL)

# msgSavePassword
source: Save Password? If 'No', password will be required each time you connect
pt_br: Salvar a senha? Se escolher 'Não', a senha será solicitada sempre que você se conectar

# profileNamePrompt
source: Profile Name
pt_br: Nome do perfil

# profileNamePlaceholder
source: [Optional] Enter a display name for this connection profile
pt_br: [Opcional] Insira um nome de exibição para este perfil de conexão

# filepathPrompt
source: File path
pt_br: Caminho do arquivo

# filepathMessage
source: File name
pt_br: Nome do arquivo

# overwritePrompt
source: A file with this name already exists. Do you want to replace the existing file?
pt_br: Já existe um arquivo com este nome. Você deseja substituir o arquivo existente?

# overwritePlaceholder
source: A file with this name already exists
pt_br: Já existe um arquivo com este nome

# msgCannotOpenContent
source: Error occurred opening content in editor.
pt_br: Erro ao abrir o conteúdo no editor.

# msgSaveStarted
source: Started saving results to
pt_br: Iniciado o salvamento de resultados em

# msgSaveFailed
source: Failed to save results.
pt_br: Falha ao salvar os resultados.

# msgSaveSucceeded
source: Successfully saved results to
pt_br: Os resultados foram salvos com sucesso em

# msgSelectProfileToRemove
source: Select profile to remove
pt_br: Selecione um perfil para remover

# confirmRemoveProfilePrompt
source: Confirm to remove this profile.
pt_br: Confirme para remover este perfil.

# msgNoProfilesSaved
source: No connection profile to remove.
pt_br: Nenhum perfil de conexão para remover.

# msgProfileRemoved
source: Profile removed successfully
pt_br: Perfil removido com sucesso

# msgProfileCreated
source: Profile created successfully
pt_br: Perfil criado com sucesso

# msgProfileCreatedAndConnected
source: Profile created and connected
pt_br: Perfil criado e conectado

# msgClearedRecentConnections
source: Recent connections list cleared
pt_br: Lista de conexões recentes limpa

# msgIsRequired
source: is required.
pt_br: é necessário.

# msgError
source: Error:
pt_br: Erro:

# msgYes
source: Yes
pt_br: Sim

# msgNo
source: No
pt_br: Não

# defaultDatabaseLabel
source: <default>
pt_br: <padrão>

# notConnectedLabel
source: Disconnected
pt_br: Desconectado

# notConnectedTooltip
source: Click to connect to a database
pt_br: Clique para se conectar a um banco de dados

# connectingLabel
source: Connecting
pt_br: Conectando-se

# connectingTooltip
source: Connecting to:
pt_br: Conectando-se a:

# connectErrorLabel
source: Connection error
pt_br: Erro de conexão

# connectErrorTooltip
source: Error connecting to:
pt_br: Erro ao conectar-se a:

# connectErrorCode
source: Error code:
pt_br: Código de erro:

# connectErrorMessage
source: Error Message:
pt_br: Mensagem de erro:

# cancelingQueryLabel
source: Canceling query
pt_br: Cancelando a consulta

# updatingIntelliSenseLabel
source: Updating IntelliSense...
pt_br: Atualizando o IntelliSense...

# extensionNotInitializedError
source: Unable to execute the command while the extension is initializing. Please try again later.
pt_br: Não é possível executar o comando enquanto a extensão está inicializando. Tente novamente mais tarde.

# untitledScheme
source: untitled
pt_br: sem título

# msgChangeLanguageMode
source: To use this command, you must set the language to "SQL". Confirm to change language mode.
pt_br: Para usar este comando, você deve definir a linguagem para "SQL". Confirme para alterar o modo de linguagem.

# msgChangedDatabaseContext
source: Changed database context to "{0}" for document "{1}"
pt_br: Contexto do banco de dados alterado para "{0}" para o documento "{1}"

# msgPromptRetryCreateProfile
source: Error: Unable to connect using the connection information provided. Retry profile creation?
pt_br: Erro: não é possível conectar usando as informações de conexão fornecidas. Tentar novamente a criação de perfil?

# msgPromptRetryConnectionDifferentCredentials
source: Error: Login failed. Retry using different credentials?
pt_br: Erro: falha no logon. Deseja tentar novamente usando credenciais diferentes?

# msgPromptRetryFirewallRuleExtNotInstalled
source: Your client IP address does not have access to the server. Download and install the Azure Account extension to sign in to an Azure account and create a new firewall rule to enable access.
pt_br: Seu endereço IP de cliente não tem acesso ao servidor. Baixe e instale a extensão Conta do Azure para entrar com uma conta do Azure e criar uma regra de firewall para habilitar o acesso.

# msgPromptRetryFirewallRuleNotSignedIn
source: Your client IP address does not have access to the server. Sign in to an Azure account and create a new firewall rule to enable access.
pt_br: Seu endereço IP de cliente não tem acesso ao servidor. Entre com uma conta do Azure e crie uma regra de firewall para habilitar o acesso.

# msgPromptRetryFirewallRuleSignedIn
source: Account signed In. Create new firewall rule?
pt_br: Conta conectada. Criar regra de firewall?

# msgPromptRetryFirewallRuleAdded
source: Firewall rule successfully added. Retry profile creation?
pt_br: Regra de firewall adicionada com êxito. Tentar novamente a criação de perfil?

# msgPromptAzureExtensionActivatedNotSignedIn
source: Azure Account extension activated. Sign in to an Azure account?
pt_br: Extensão Conta do Azure ativada. Entrar com uma conta do Azure?

# msgPromptAzureExtensionActivatedSignedIn
source: Azure Account extension activated and signed in.
pt_br: Extensão Conta do Azure ativada e conectada.

# msgPromptFirewallRuleCreated
source: Firewall rule successfully created.
pt_br: Regra de firewall criada com êxito.

# msgChooseQueryHistory
source: Choose Query History
pt_br: Escolher o Histórico de Consultas

# msgChooseQueryHistoryAction
source: Choose An Action
pt_br: Escolher uma Ação

# msgOpenQueryHistory
source: Open Query History
pt_br: Abrir o Histórico de Consultas

# msgRunQueryHistory
source: Run Query History
pt_br: Executar o Histórico de Consultas

# msgInvalidIpAddress
source: Invalid IP Address
pt_br: Endereço IP inválido

# msgNoQueriesAvailable
source: No Queries Available
pt_br: Não Há Consultas Disponíveis

# retryLabel
source: Retry
pt_br: Tentar novamente

# signInLabel
source: Sign In
pt_br: Entrar

# downloadAndInstallLabel
source: Download and Install
pt_br: Baixar e instalar

# createFirewallRuleLabel
source: Create Firewall Rule
pt_br: Criar regra de firewall

# msgConnecting
source: Connecting to server "{0}" on document "{1}".
pt_br: Conectando-se ao servidor "{0}" no documento "{1}".

# msgConnectedServerInfo
source: Connected to server "{0}" on document "{1}". Server information: {2}
pt_br: Conectado ao servidor "{0}" no documento "{1}". Informações do servidor: {2}

# msgConnectionFailed
source: Error connecting to server "{0}". Details: {1}
pt_br: Erro ao conectar-se ao servidor "{0}". Detalhes: {1}

# msgChangingDatabase
source: Changing database context to "{0}" on server "{1}" on document "{2}".
pt_br: Alterando o contexto do banco de dados para "{0}" no servidor "{1}" no documento "{2}".

# msgChangedDatabase
source: Changed database context to "{0}" on server "{1}" on document "{2}".
pt_br: Contexto do banco de dados alterado para "{0}" no servidor "{1}" no documento "{2}".

# msgDisconnected
source: Disconnected on document "{0}"
pt_br: Desconectado do documento "{0}"

# msgErrorReadingConfigFile
source: Error: Unable to load connection profiles from [{0}]. Check if the file is formatted correctly.
pt_br: Erro: não é possível carregar perfis de conexão de [{0}]. Verifique se o arquivo está formatado corretamente.

# titleResultsPane
source: Results: {0}
pt_br: Resultados: {0}

# macOpenSslErrorMessage
source: OpenSSL version >=1.0.1 is required to connect.
pt_br: É necessária a versão 1.0.1 ou mais recente do OpenSSL para se conectar.

# macOpenSslHelpButton
source: Help
pt_br: Ajuda

# macSierraRequiredErrorMessage
source: macOS Sierra or newer is required to use this feature.
pt_br: Para usar este recurso é necessário o macOS Sierra ou mais recente.

# gettingDefinitionMessage
source: Getting definition ...
pt_br: Obtendo definição...

# testLocalizationConstant
source: test
pt_br: teste

# disconnectOptionLabel
source: Disconnect
pt_br: Desconectar

# disconnectOptionDescription
source: Close the current connection
pt_br: Fechar a conexão atual

# disconnectConfirmationMsg
source: Are you sure you want to disconnect?
pt_br: Tem certeza de que deseja desconectar?

# elapsedBatchTime
source: Batch execution time: {0}
pt_br: Tempo de execução em lote: {0}

# noActiveEditorMsg
source: A SQL editor must have focus before executing this command
pt_br: Um editor SQL deve ter foco antes de executar este comando

# maximizeLabel
source: Maximize
pt_br: Maximizar

# restoreLabel
source: Restore
pt_br: Restaurar

# saveCSVLabel
source: Save as CSV
pt_br: Salvar como CSV

# saveJSONLabel
source: Save as JSON
pt_br: Salvar como JSON

# saveExcelLabel
source: Save as Excel
pt_br: Salvar como Excel

# resultPaneLabel
source: Results
pt_br: Resultados

source: Select all
pt_br: Selecionar tudo

# copyLabel
source: Copy
pt_br: Copiar

# copyWithHeadersLabel
source: Copy with Headers
pt_br: Copiar com cabeçalhos

# executeQueryLabel
source: Executing query...
pt_br: Executando consulta...

# messagePaneLabel
source: Messages
pt_br: Mensagens

# lineSelectorFormatted
source: Line {0}
pt_br: Linha {0}

# elapsedTimeLabel
source: Total execution time: {0}
pt_br: Tempo total de execução: {0}

# msgCannotSaveMultipleSelections
source: Save results command cannot be used with multiple selections.
pt_br: O comando para salvar resultados não pode ser usado com múltiplas seleções.

# noneProviderName
source: None
pt_br: Nenhum

# chooseSqlLang
source: Choose SQL Language
pt_br: Escolher linguagem SQL

# flavorChooseLanguage
source: Choose SQL Language
pt_br: Escolher linguagem SQL

# flavorDescriptionMssql
source: Use T-SQL intellisense and syntax error checking on current document
pt_br: Use o T-SQL IntelliSense e a verificação de erros de sintaxe no documento atual

# flavorDescriptionNone
source: Disable intellisense and syntax error checking on current document
pt_br: Desabilite o IntelliSense e a verificação de erros de sintaxe no documento atual

# queryOutputDocumentTitle
source: Query Output Document
pt_br: Documento de saída da consulta

# queryOutputHostTitle
source: Query Output Document Host
pt_br: Host do documento de saída da consulta

# msgAddConnection
source: Add Connection
pt_br: Adicionar conexão

# msgConnect
source: Connect
pt_br: Conectar

source: Azure: Sign In
pt_br: Azure: entrar

# azureSignInDescription
source: Sign in to your Azure subscription
pt_br: Entrar com sua assinatura do Azure

source: Azure: Sign In with Device Code
pt_br: Azure: entrar com o código do dispositivo

# azureSignInWithDeviceCodeDescription
source: Sign in to your Azure subscription with a device code. Use this in setups where the Sign In command does not work
pt_br: Entre com sua assinatura do Azure com um código do dispositivo. Use isso nas configurações nas quais o comando Entrar não funciona

source: Azure: Sign In to Azure Cloud
pt_br: Azure: entrar no Azure Cloud

# azureSignInToAzureCloudDescription
source: Sign in to your Azure subscription in one of the sovereign clouds.
pt_br: Entre com sua assinatura do Azure em uma das nuvens soberanas.
